[{"name":"Personas and Storyboarding", "product_type":"Class Project for CS 1300 UIUX", "slogan":"I interviewed users about their experiences using this machine. The response I got varies. Some users are especially experienced while some seem not sure how to use it. About half of the users wipe the equipment with alcohol wipes after using it. Everyone said that they figured out how to use it pretty quickly but I feel some of them don’t really understand how to use the equipment because they didn’t adjust it before using. One user said that the fact that some people don’t wipe it after use makes it difficult because you need to wipe it by yourself at the beginning. Others mention that it’s hard to figure out how to adjust the chest support pad. None of them have scanned the QR code or read the description. Users said that they used similar equipment before, learned by observing others, and figured out how to use it by trying it out. I also created two personas of users: Gibbon and Alex. Alex comes to the gym a lot and is very used to this equipment. Gibbon rarely comes to the gym and is learning about it the first time. Therefore, they have very different experiences using the machine. Alex just wants to finish his workout quickly before he can get back to his assignments and he is annoyed that other people don’t clean up their machines. Gibbon is nervous because he doesn’t know how to use this equipment. He is looking for descriptions and is eager for someone to help him. I also created a storyboard of Gibbon’s first day using this equipment. He is nervous at first but learned to use it after observing Alex.", "price":"https://fantasticlion.github.io/", "release_time":"This includes a sketch I did for the Torso Rotation Machine, some interviews I conducted to the users using it, two personas of two different users: Alex who is experienced with this machine and Gibbon who is new to using it, and a storyboard of Gibbon's first time using this machine.", "processor":"I created personas and storyboards for the Torso Rotation machine in Nelson Fitness Center.", "image_link":"https://fantasticlion.github.io/photos/assets/hw1.jpeg", "id":1}, 
{"name":"Iterative Design & Evaluation", "product_type":"Class Project for CS 1300 UIUX", "slogan":"1Flow is a startup we found from YCombinator that helps website creators gather comments from users. We were not allowed to look at 1Flow's implementation when we designed our version of the startup. We each created sketches about different pages of the app and then combined them and made our low-fi and high-fi prototypes. Our final design includes pages for designers of questionnaires and users filling out reviews. For designers, we have a home page, a \"Sign in\" page, a “My Apps” page displaying all websites you have, a “Edit Questionnaire” page for users to edit their questionnaires, and a “View Stats” page for you to view stats of your websites. For users, we have a page displaying questionnaires for users to fill out. We also got feedbacks from classmates and UserTesting.com and improved our design according to them.", "price":"https://excitedelephant777.github.io/uiux-project-3/", "release_time":"1Flow is a startup for users to give comments on the websites. We first created sketches of different frames of 1Flow. Then we made low-fi and high-fi prototypes according to them and did a figma presentation. We presented them to the class and users on UserTesting.com and adjusted our model according to their feedbacks.", "processor":"I worked with a team to create a prototype for the startup 1Flow. ", "image_link":"https://fantasticlion.github.io/photos/assets/itdesign.jpeg", "id":3}, 
{"name":"Responsive Redesign", "product_type":"Class Project for CS 1300 UIUX", "slogan":"I redesigned the website for Paulo Coelho because I found some things that could be improved in the original website. There are too many things displayed in the site, including the blogs, email address, and social media accounts so that viewers will be easily distracted. The images attached to each of the blog posts are too small so it is hard to get viewers' attention. Also, the name \"Paulo Coelho\" at the top of the site is too big, which distracts viewers from the main contents. Last but not least, the site is splitted into two parts: the left part for blogs and the right part for subscriptions. Users shouldn't have to look left and right for information. Therefore, I redesigned the website. I made the images bigger and removed distracting contents from the website to make it clearer. I drew low-fi and high-fi prototypes and a visual style guide for my version of the website before starting to implement my design.", "price":"https://fantasticlion.github.io/beautifullion/", "release_time":"I found there are too many things displayed in the site, including the blogs, email address, and social media accounts so that viewers will be easily distracted. The images attached to each of the blog post are too small. It is hard to get viewers' attention. Also, the name \"Paulo Coelho\" at the top of the site is too big, which distracts viewers from the main contents. Last but not least, the site is splitted into two parts: the left part for blogs and the right part for subscriptions. Users shouldn't have to look left and right for information.", "processor":"I redesigned the website for Paulo Coelho. ", "image_link":"https://fantasticlion.github.io/photos/assets/paulo.jpeg", "id":2}, 
{"name":"Development", "product_type":"Class Project for CS 1300 UIUX", "slogan":"In this Apple Store, you can filter Apple's products according to categories like product types (iPhone, iPad, Notebook, Desktop); or years in which they are released. You can also sort products according to product types and prices. There is also the function of adding products to a list of favorites and the total price of all favorite products is displayed. The page will be reset after clicking the \"Reset\" button.", "price":"https://fantasticlion.github.io/react-stencil", "release_time":"You can filter Apple's products according to categories like iphone, ipad, notebook, desktop; or years in which they are released. You can also sort them according to product types and prices. Last but not least, there is also the function of adding them to a list of favorite products. ", "processor":"I made an Apple Store with sorting, filtering, and “add to favorites” functionalities.", "image_link":"https://fantasticlion.github.io/photos/assets/applestore.jpeg", "id":4}]